# ISaveSharedCoordinatesCallback Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ISaveSharedCoordinatesCallback Members
ISaveSharedCoordinatesCallback Interface Methods See Also
---
The ISaveSharedCoordinatesCallback type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSaveModifiedLinksOption | Determines whether Revit should save the link, not save the link, or discard shared positioning entirely. |

# See Also
ISaveSharedCoordinatesCallback Interface
Autodesk.Revit.DB Namespace